import matplotlib.pyplot as plt

# 定义x轴和y轴的数据
x = list(range(1, 47))
y = [56.35, 56.25, 55.85, 55.75, 55.7, 55.85, 56.55,
     55.8, 55.9, 55.75, 55.9, 55.7, 55.6, 55.3,
     55.2, 55.45, 55.15, 55.4, 55.5, 55.4, 54.85,
     55.1, 54.65, 54.7, 54.7, 54.7, 54.5, 54.45,
     54.15, 54.5, 54.7, 54.75, 54.65, 54.4, 54.35,
     54.0, 53.8, 54.25, 53.9, 53.8, 53.85, 53.65,
     53.7, 53.85, 53.85, 53.00
     ]

# 绘制折线图
plt.plot(x, y)

# 设置图表标题和坐标轴标签
plt.title("Line Chart")
plt.xlabel("Date")
plt.ylabel("Weight")

# 显示网格线
plt.grid(True)

# 显示图表
plt.show()

print("哈哈哈哈哈")